In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Month_Value_1.csv")

In [3]:
df

,Period,Revenue,Sales_quantity,Average_cost,The_average_annual_payroll_of_the_region
0,01.01.2015,1.601007e+07,12729.0,1257.763541,30024676.0
1,01.02.2015,1.580759e+07,11636.0,1358.507000,30024676.0
2,01.03.2015,2.204715e+07,15922.0,1384.697024,30024676.0
3,01.04.2015,1.881458e+07,15227.0,1235.606705,30024676.0
4,01.05.2015,1.402148e+07,8620.0,1626.621765,30024676.0
...,...,...,...,...,...
91,01.08.2022,NaN,NaN,NaN,NaN
92,01.09.2022,NaN,NaN,NaN,NaN
93,01.10.2022,NaN,NaN,NaN,NaN
94,01.11.2022,NaN,NaN,NaN,NaN
95,01.12.2022,NaN,NaN,NaN,NaN

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 96 entries, 0 to 95
Data columns (total 5 columns):
 #   Column                                    Non-Null Count  Dtype
---  ------                                    --------------  -----
 0   Period                                    96 non-null     object
 1   Revenue                                   64 non-null     float64
 2   Sales_quantity                            64 non-null     float64
 3   Average_cost                              64 non-null     float64
 4   The_average_annual_payroll_of_the_region  64 non-null     float64
dtypes: float64(4), object(1)
memory usage: 3.9+ KB

In [7]:
df.select_dtypes(include="object")

        Period
0   01.01.2015
1   01.02.2015
2   01.03.2015
3   01.04.2015
4   01.05.2015
..         ...
91  01.08.2022
92  01.09.2022
93  01.10.2022
94  01.11.2022
95  01.12.2022

[96 rows x 1 columns]

In [10]:
df.Period.nunique()

96

In [16]:
(df.Period.value_counts()==1).all()

True

In [18]:
df.isna().sum()

Period                                       0
Revenue                                     32
Sales_quantity                              32
Average_cost                                32
The_average_annual_payroll_of_the_region    32
dtype: int64

In [19]:
96-32

64

In [21]:
df.isnull().sum()

Period                                       0
Revenue                                     32
Sales_quantity                              32
Average_cost                                32
The_average_annual_payroll_of_the_region    32
dtype: int64

In [44]:
p=df[df.Revenue.notnull()==True]
p

,Period,Revenue,Sales_quantity,Average_cost,The_average_annual_payroll_of_the_region
0,01.01.2015,1.601007e+07,12729.0,1257.763541,30024676.0
1,01.02.2015,1.580759e+07,11636.0,1358.507000,30024676.0
2,01.03.2015,2.204715e+07,15922.0,1384.697024,30024676.0
3,01.04.2015,1.881458e+07,15227.0,1235.606705,30024676.0
4,01.05.2015,1.402148e+07,8620.0,1626.621765,30024676.0
...,...,...,...,...,...
59,01.12.2019,5.875647e+07,38069.0,1543.420464,29878525.0
60,01.01.2020,5.628830e+07,27184.0,2070.640850,29044998.0
61,01.02.2020,4.022524e+07,23509.0,1711.057181,29044998.0
62,01.03.2020,5.002217e+07,32569.0,1535.882748,29044998.0
63,01.04.2020,5.232069e+07,26615.0,1965.834790,29044998.0

In [46]:
p["Period"]=pd.to_datetime(p["Period"],format="%d.%m.%Y")
p

C:\Users\prash\AppData\Local\Temp\ipykernel_17012\3258734914.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  p["Period"]=pd.to_datetime(p["Period"],format="%d.%m.%Y")

,Period,Revenue,Sales_quantity,Average_cost,The_average_annual_payroll_of_the_region
0,2015-01-01,1.601007e+07,12729.0,1257.763541,30024676.0
1,2015-02-01,1.580759e+07,11636.0,1358.507000,30024676.0
2,2015-03-01,2.204715e+07,15922.0,1384.697024,30024676.0
3,2015-04-01,1.881458e+07,15227.0,1235.606705,30024676.0
4,2015-05-01,1.402148e+07,8620.0,1626.621765,30024676.0
...,...,...,...,...,...
59,2019-12-01,5.875647e+07,38069.0,1543.420464,29878525.0
60,2020-01-01,5.628830e+07,27184.0,2070.640850,29044998.0
61,2020-02-01,4.022524e+07,23509.0,1711.057181,29044998.0
62,2020-03-01,5.002217e+07,32569.0,1535.882748,29044998.0
63,2020-04-01,5.232069e+07,26615.0,1965.834790,29044998.0

In [31]:
p.Period.dtype

dtype('<M8[ns]')

In [32]:
p.dtypes

Period                                      datetime64[ns]
Revenue                                            float64
Sales_quantity                                     float64
Average_cost                                       float64
The_average_annual_payroll_of_the_region           float64
dtype: object

In [47]:
p.Period.dt.month

0      1
1      2
2      3
3      4
4      5
      ..
59    12
60     1
61     2
62     3
63     4
Name: Period, Length: 64, dtype: int64

In [48]:
p.columns

Index(['Period', 'Revenue', 'Sales_quantity', 'Average_cost',
       'The_average_annual_payroll_of_the_region'],
      dtype='object')

In [50]:
p1=p[["Period","Revenue"]]

In [52]:
p1["Month"]=p.Period.dt.month
p1["Year"]=p.Period.dt.year

C:\Users\prash\AppData\Local\Temp\ipykernel_17012\2402405370.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  p1["Month"]=p.Period.dt.month
C:\Users\prash\AppData\Local\Temp\ipykernel_17012\2402405370.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  p1["Year"]=p.Period.dt.year

In [53]:
p1

       Period       Revenue  Month  Year
0  2015-01-01  1.601007e+07      1  2015
1  2015-02-01  1.580759e+07      2  2015
2  2015-03-01  2.204715e+07      3  2015
3  2015-04-01  1.881458e+07      4  2015
4  2015-05-01  1.402148e+07      5  2015
..        ...           ...    ...   ...
59 2019-12-01  5.875647e+07     12  2019
60 2020-01-01  5.628830e+07      1  2020
61 2020-02-01  4.022524e+07      2  2020
62 2020-03-01  5.002217e+07      3  2020
63 2020-04-01  5.232069e+07      4  2020

[64 rows x 4 columns]